#+TODO: TODO(t@) TOIMPL(i@) SPEC(r@) BLOCK(b@) UPGR(u@) | DONE(d!)
#+STARTUP: indent logdone logdrawer content lognoteclock-out
# ------------------------------------------------------
#+NOIR_TEMPLATE_URL: https://github.com/noir-lang/noir/blob/%h/%p#L%lC%c-L%lC%s
# ------------------------------------------------------
#+TITLE: Noir Tree-sitter Grammar
#+AUTHOR: Jordan Ellis Coppard
#+LANGUAGE: en
#+OPTIONS: ^:{}

All notes currently against upstream commit {{{keyword(NOIR_VERSION)}}}.

Noir's syntax isn't officially specified currently; expected given the language is pre 1.0. So, here are notes and links to compiler infrastructure to ascertain language minutia.

***** DONE ModOrContract
CLOSED: [2026-02-19 Thu 20:10]
:PROPERTIES:
:CUSTOM_ID: h:9204514E-E5FC-488B-8066-66F0D9AF0C85
:END:
:LOGBOOK:
CLOCK: [2026-02-19 Thu 19:48]--[2026-02-19 Thu 20:10] =>  0:22
- Review Module, ModOrContract.
- State "DONE"       from "UPGR"       [2026-02-19 Thu 20:09] \\
  No apparent change.
- State "UPGR"       from "DONE"       [2026-02-18 Wed 21:39] \\
  Noir v1.0.0-beta.19
- State "DONE"       from "TODO"       [2025-06-08 Sun 21:02]
:END:

#+name: mod_or_contract
#+begin_src js :rule module_or_contract_item :arg $ :ast ModOrContract
seq(
    optional(<<r("item_visibility")>>),
    choice('mod', 'contract'), // TODO: Discriminate kind into a field?
    field('name', <<r("identifier")>>),
    choice(
        ';',
        field('body', $.item_list),
    ),
)
#+end_src

Parser: [[file:noir/compiler/noirc_frontend/src/parser/parser/item.rs::if let Some(is_contract) = self.eat_mod_or_contract() {][parse_mod_or_contract() parent callsite]], [[file:noir/compiler/noirc_frontend/src/parser/parser/module.rs::pub(super) fn parse_mod_or_contract(][parse_mod_or_contract()]]

#+name: ,ebnf_mod_or_contract
#+transclude: [[file:noir/compiler/noirc_frontend/src/parser/parser/module.rs::/// ModOrContract][ModOrContract doc]]  :lines 1- :src fundamental :end "pub(super) fn parse_mod_or_contract("

Only the [[#h:F5A79701-65C9-4FEA-83D8-2413C585A5FA][ItemVisibility]] modifier is applicable, all other [[#h:2A9D09A5-2E52-4B8C-ABA1-0B3B953F093C][Modifiers]] are parse errors. Eat =mod= or =contract= keywords, ~validate_secondary_attributes~. If the brace group is not hit it's a ~ItemKind::ModuleDecl~ (declaration), otherwise a real submodule.

i.e. =mod foo;= is a module declaration and =mod { let x = 123; }= is a real module.

***** DONE Trait
CLOSED: [2026-02-19 Thu 18:58]
:PROPERTIES:
:CUSTOM_ID: h:6C38714F-76B7-4472-A776-36023EB84873
:END:
:LOGBOOK:
- State "DONE"       from "UPGR"       [2026-02-19 Thu 18:58] \\
  Apparent update to v1.0.0-beta.19 no more errors currently.
CLOCK: [2026-02-19 Thu 15:29]--[2026-02-19 Thu 18:56] =>  3:27
- - Finish review of traits.rs and further nested logic like bounds and generics.
  - Implement updates to latest grammar as it appears from parser frontend.
CLOCK: [2026-02-18 Wed 23:09]--[2026-02-18 Wed 23:50] =>  0:41
- - Skimming parser/traits.rs; basic outline of what has changed and what I need to do tomorrow.
- State "UPGR"       from "DONE"       [2026-02-18 Wed 21:39] \\
  Noir v1.0.0-beta.19
- State "DONE"       from "TOIMPL"     [2025-07-14 Mon 02:33]
- State "TOIMPL"     from "TODO"       [2025-07-10 Thu 15:34] \\
  parse_trait() examined
:END:

#+name: trait
#+begin_src js :rule trait_item :arg $ :ast Trait
seq(
    optional(<<r("item_visibility")>>),
    'trait',
    field('name', <<r("identifier")>>),
    field('type_parameters', optional(<<r("generic_parameters")>>)),
    choice(<<r("trait_tail_alias")>>, <<r("trait_tail")>>),
)
#+end_src

#+name: trait_tail
#+begin_src js :rule __trait_tail :arg $
seq(
    field('bounds', optional(seq(':', <<r("trait_bounds")>>))),
    optional(<<r("where")>>),
    field('body', alias(<<r("trait_body")>>, $.declaration_list)),
)
#+end_src

#+name: trait_tail_alias
#+begin_src js :rule __trait_tail_alias :arg $
seq(
    field('bounds', seq('=', <<r("trait_bounds")>>)),
    optional(<<r("where")>>),
    ';',
)
#+end_src

Parser: [[file:noir/compiler/noirc_frontend/src/parser/parser/item.rs::if self.eat_keyword(Keyword::Trait) {][parse_trait() parent callsite]], [[file:noir/compiler/noirc_frontend/src/parser/parser/traits.rs::pub(crate) fn parse_trait(][parse_trait()]]
Types: [[file:noir/compiler/noirc_frontend/src/ast/traits.rs::pub struct NoirTrait {][NoirTrait struct]]
Only [[#h:F5A79701-65C9-4FEA-83D8-2413C585A5FA][ItemVisibility]] modifier applicable, all other [[#h:2A9D09A5-2E52-4B8C-ABA1-0B3B953F093C][Modifiers]] are parse errors ([[#h:14698757-D7C8-4966-B84E-5DA1CAE3011E][see more]]).
Traits can be aliases of others.

#+name: ,ebnf_trait
#+transclude: [[file:noir/compiler/noirc_frontend/src/parser/parser/traits.rs::/// Trait =][Trait doc]]  :lines 1- :src fundamental :end "pub(crate) fn parse_trait("

****** UPGR FunctionParameters
:PROPERTIES:
:CUSTOM_ID: h:B635EAF3-0AE1-47E0-8817-7174186912D8
:END:
:LOGBOOK:
CLOCK: [2026-02-18 Wed 22:57]--[2026-02-18 Wed 23:03] =>  0:06
- Corrected links but functions have some other dependencies so I'll do more atomic items first.
- State "UPGR"       from "DONE"       [2026-02-18 Wed 21:39] \\
  Noir v1.0.0-beta.19
- State "DONE"       from "TODO"       [2025-07-22 Tue 02:49]
:END:

#+name: function_parameters
#+begin_src js :rule parameters :arg $ :ast FunctionParameters
seq(
    '(',
    optional(seq(
        // Inlined Noirc: FunctionParametersList.
        sepBy1(choice(
            <<r("self_pattern")>>,
            alias(<<r("function_parameter")>>, $.parameter),
        ), ','),
        optional(','),
    )),
    ')',
)
#+end_src

Parser: [[file:noir/compiler/noirc_frontend/src/parser/parser/function.rs::fn parse_function_parameters(&mut self, allow_self: bool)][parse_function_parameters()]]

#+name: ,ebnf_function_parameters
#+transclude: [[file:noir/compiler/noirc_frontend/src/parser/parser/function.rs::/// FunctionParameters =][FunctionParameters doc]]  :lines 1- :src fundamental :end "fn parse_function_parameters("

